const task3 = {
    isPalindrom(candidate) {
        //ф-ция получает на вход слово(последовательность символов без пробелов), например 'Hello';
        //если слово candidate является палиндромом - вернуть true, иначе - false;
    },
    findPalindroms(srcString) {
        //ф-ция получает на вход строку со словами, слова разделяются пробелами
        //ф-ция должна вернуть список всех слов являющихся палиндромами
    },
    findDuplicates(array) {
        //вернуть список элементов массива, которые встречаются в массиве больше одного раза
    },
    sortWords(srcString) {
        // ф-ция получает на вход строку со словами, слова разделяются пробелами
        // ф-ция возвращает строку, слова в которой будут отсортированы по длине
        // вначале будут самые короткие слова
    },
    //после того как эти задачи будут сделаны, модифицировать код с учетом того, 
    //что слова в строке могут разделяться не только пробелами но ещё и следующими символами [',', ';', '.', '?', '!']
};